profiling/results/stage-5_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 5.686ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.460ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.98ms    4.64ms  52.45ms   91.06%
    Req/Sec   511.28     90.25     0.95k    79.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.69ms
 75.000%    4.90ms
 90.000%    8.70ms
 99.000%   25.69ms
 99.900%   43.84ms
 99.990%   49.57ms
 99.999%   52.48ms
100.000%   52.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.854     0.000000            1         0.00
       2.165     0.100000         5000 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.625     0.200000         9996         0.00
       2.999     0.300000        14995        -0.00
       3.335     0.400000        20024        -0.00
       3.693     0.500000        24989         0.00
       3.885     0.550000        27489 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       4.087     0.600000        30008         0.00
       4.311     0.650000        32515        -0.00
       4.575     0.700000        35005        -0.00
       4.903     0.750000        37482         0.00
       5.107     0.775000        38732 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       5.379     0.800000        39987         0.00
       5.751     0.825000        41232        -0.00
       6.283     0.850000        42484        -0.00
       7.131     0.875000        43726         0.00
       7.855     0.887500        44353 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       8.703     0.900000        44975         0.00
       9.815     0.912500        45600        -0.00
      11.103     0.925000        46225        -0.00
      12.671     0.937500        46856         0.00
      13.615     0.943750        47161 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
      14.479     0.950000        47473         -nan
      15.455     0.956250        47785        -0.00
      16.623     0.962500        48099        -0.00
      17.983     0.968750        48410         0.00
      18.735     0.971875        48572 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      19.551     0.975000        48724         -nan
      20.463     0.978125        48879        -0.00
      21.423     0.981250        49035        -0.00
      22.687     0.984375        49191         0.00
      23.391     0.985938        49269 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      24.319     0.987500        49347         0.00
      25.183     0.989062        49425        -0.00
      26.111     0.990625        49504        -0.00
      27.247     0.992188        49582         0.00
      27.919     0.992969        49621 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      28.751     0.993750        49659         0.00
      29.855     0.994531        49698        -0.00
      31.215     0.995313        49737        -0.00
      32.927     0.996094        49776         0.00
      33.855     0.996484        49796 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      34.911     0.996875        49815         -nan
      36.575     0.997266        49835        -0.00
      37.439     0.997656        49855        -0.00
      39.103     0.998047        49874         0.00
      40.351     0.998242        49884 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      40.959     0.998437        49893         -nan
      41.983     0.998633        49903        -0.00
      42.911     0.998828        49913        -0.00
      44.127     0.999023        49923         0.00
      44.415     0.999121        49928 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      45.183     0.999219        49932         0.00
      45.503     0.999316        49937        -0.00
      46.207     0.999414        49942        -0.00
      46.911     0.999512        49948         0.00
      47.103     0.999561        49950 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      47.295     0.999609        49952         0.00
      47.423     0.999658        49954        -0.00
      47.775     0.999707        49957        -0.00
      47.903     0.999756        49959         0.00
      48.255     0.999780        49961 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      48.319     0.999805        49962         -nan
      48.767     0.999829        49963        -0.00
      48.959     0.999854        49964        -0.00
      49.247     0.999878        49965         0.00
      49.567     0.999890        49966 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      49.599     0.999902        49967         -nan
      49.599     0.999915        49967        -0.00
      49.759     0.999927        49968        -0.00
      49.759     0.999939        49968         0.00
      50.015     0.999945        49969 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      50.015     0.999951        49969         0.00
      50.015     0.999957        49969        -0.00
      51.999     0.999963        49970        -0.00
      51.999     0.999969        49970         0.00
      51.999     0.999973        49970 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      51.999     0.999976        49970         0.00
      51.999     0.999979        49970        -0.00
      52.479     0.999982        49971        -0.00
      52.479     1.000000        49971         0.00
#[Mean    =        4.981, StdDeviation   =        4.644]
#[Max     =       52.448, Total count    =        49971]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59982 requests in 1.00m, 3.83MB read
Requests/sec:    999.75
Transfer/sec:     65.41KB